[
  {
    "id": "mm-001",
    "day": 1,
    "category": "groceries",
    "title": "The Freezer Batch Trick",
    "summary": "Save up to $120/month by cooking double and freezing half.",
    "body": "Next time you cook dinner, make double and freeze half. You'll have ready-made meals for those busy nights when takeaway is tempting. Most families spend $120+ per month on convenience meals they could have batch-prepared. Start with Sunday — cook a big pot of something the kids love, portion it up, and freeze. Future-you will be so grateful.",
    "potentialMonthlySaving": 120,
    "readTimeSeconds": 60,
    "isRebeccaPick": true
  },
  {
    "id": "mm-002",
    "day": 2,
    "category": "subscriptions",
    "title": "The Subscription Audit",
    "summary": "The average family has 3 forgotten subscriptions costing $45/month.",
    "body": "Grab your phone right now and check your subscriptions (Settings > Your Name > Subscriptions on iPhone). You'll likely find at least one you forgot about. The average family wastes $45/month on subscriptions they barely use. Cancel anything you haven't used in the last 2 weeks — you can always re-subscribe later.",
    "potentialMonthlySaving": 45,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-003",
    "day": 3,
    "category": "energy",
    "title": "The 1-Degree Rule",
    "summary": "Adjusting your thermostat by just 1 degree saves ~$100/year.",
    "body": "Here's a tiny change with a big impact: turn your heating down by just 1 degree. Most people can't even feel the difference, but your energy bill certainly can. That's roughly $100 saved per year. In summer, set the AC 1 degree higher. Your kids won't notice, your wallet will.",
    "potentialMonthlySaving": 8,
    "readTimeSeconds": 40,
    "isRebeccaPick": false
  },
  {
    "id": "mm-004",
    "day": 4,
    "category": "groceries",
    "title": "Store-Brand Secret",
    "summary": "Store-brand products are often made in the same factories as name brands.",
    "body": "Here's a secret the big brands don't want you to know: most store-brand products are made in the exact same factories as the expensive name brands. Same ingredients, same quality, different label. Start with basics like pasta, tinned tomatoes, and cleaning products. A family switching just 10 items to store-brand saves an average of $60/month.",
    "potentialMonthlySaving": 60,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-005",
    "day": 5,
    "category": "dining",
    "title": "The Coffee Maths",
    "summary": "Your daily coffee habit might be costing you $1,500+ per year.",
    "body": "Let's do the maths: a $5 coffee, 5 days a week = $100/month = $1,200/year. Make it a fancy one and you're looking at $1,500+. You don't have to give up coffee — just make it at home 3 days a week. A good travel mug and decent coffee beans cost less than a week of cafe visits. That's $720 back in your pocket each year.",
    "potentialMonthlySaving": 60,
    "readTimeSeconds": 55,
    "isRebeccaPick": true
  },
  {
    "id": "mm-006",
    "day": 6,
    "category": "shopping",
    "title": "The 48-Hour Rule",
    "summary": "Wait 48 hours before any non-essential purchase over $30.",
    "body": "Before buying anything over $30 that isn't a necessity, wait 48 hours. Put it in your cart, screenshot it, write it down — then walk away. Research shows 70% of people don't go back to buy it. That impulse fades quickly. If you still want it after 48 hours, go for it guilt-free. But most of the time, you'll realize you didn't need it.",
    "potentialMonthlySaving": 80,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-007",
    "day": 7,
    "category": "mindset",
    "title": "Money Date Night",
    "summary": "Spending 15 minutes a week reviewing finances reduces money stress by 40%.",
    "body": "Set aside 15 minutes every Sunday evening for a 'money date.' Check your savings goals, review what you spent, and plan the week ahead. Studies show that people who regularly check their finances report 40% less money stress. Make it cozy — grab a cup of tea, put the kids to bed, and treat it as self-care for your wallet.",
    "potentialMonthlySaving": 0,
    "readTimeSeconds": 55,
    "isRebeccaPick": true
  },
  {
    "id": "mm-008",
    "day": 8,
    "category": "kids",
    "title": "Toy Library Magic",
    "summary": "Toy libraries let kids enjoy new toys without the price tag.",
    "body": "Did you know toy libraries exist? Just like book libraries, but for toys. Kids get bored of toys quickly — usually within 2-3 weeks. Instead of buying, borrow! Many communities have toy libraries, and some regular libraries have toy sections too. Search 'toy library near me.' You could save $50-100/month, and your house stays tidier too.",
    "potentialMonthlySaving": 75,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-009",
    "day": 9,
    "category": "transport",
    "title": "Fuel Day Strategy",
    "summary": "Filling up on the cheapest day of the week saves $15-20/month.",
    "body": "Fuel prices fluctuate throughout the week in a predictable pattern. In most areas, Tuesday or Wednesday tends to be the cheapest day to fill up. Use an app like GasBuddy to track prices near you. Also, don't wait until your tank is nearly empty — you're more likely to stop at whatever station is closest (and priciest). Planning your fill-ups saves $15-20/month.",
    "potentialMonthlySaving": 18,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-010",
    "day": 10,
    "category": "groceries",
    "title": "The Meal Plan Magic",
    "summary": "Families who meal plan spend 25% less on groceries.",
    "body": "Meal planning isn't about being perfect — it's about having a rough idea of dinner for the next 5 days. Families who meal plan spend 25% less on groceries because they buy only what they need and waste less food. Keep it simple: pick 5 dinners on Sunday, write a list, shop once. That's it. No fancy apps needed — a note on your fridge works perfectly.",
    "potentialMonthlySaving": 150,
    "readTimeSeconds": 55,
    "isRebeccaPick": true
  },
  {
    "id": "mm-011",
    "day": 11,
    "category": "subscriptions",
    "title": "The Loyalty Tax",
    "summary": "Call your internet/phone provider and ask for a better deal. It works 80% of the time.",
    "body": "Companies give their best prices to new customers, not loyal ones. This is called the 'loyalty tax.' Fix it with one phone call: 'Hi, I've been a customer for X years and I've noticed new customers get better rates. Can you match that?' This works about 80% of the time. Average saving: $20-40/month on internet, phone, or insurance.",
    "potentialMonthlySaving": 30,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-012",
    "day": 12,
    "category": "energy",
    "title": "Vampire Power Drain",
    "summary": "Devices on standby cost the average home $150/year in wasted electricity.",
    "body": "Those little red standby lights on your TV, game console, and chargers? They're called 'vampire power' and they're draining your electricity 24/7. The average home wastes $150/year on standby power. Get a power strip with an on/off switch for your entertainment center and turn it off at night. Easy fix, real savings.",
    "potentialMonthlySaving": 13,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-013",
    "day": 13,
    "category": "shopping",
    "title": "The Price-Per-Use Test",
    "summary": "Before buying, divide the price by how many times you'll use it.",
    "body": "Here's a simple way to decide if something is worth buying: divide the price by how many times you'll use it. A $100 jacket you'll wear 100 times = $1 per wear (great value!). A $50 kitchen gadget you'll use twice = $25 per use (skip it). This mental trick helps you invest in quality where it matters and skip the impulse buys.",
    "potentialMonthlySaving": 40,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-014",
    "day": 14,
    "category": "kids",
    "title": "Birthday Party Swap",
    "summary": "Host a simple party at home or the park instead of expensive venues.",
    "body": "The average kids' birthday party at a venue costs $300-500. But here's a secret: kids under 8 genuinely don't care about the venue. A treasure hunt in the backyard, a pizza-making party in the kitchen, or a picnic in the park creates better memories. Budget $50-100 for food and simple activities. Kids remember the fun, not the price tag.",
    "potentialMonthlySaving": 30,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-015",
    "day": 15,
    "category": "mindset",
    "title": "The Gratitude Trick",
    "summary": "Practicing gratitude for what you have reduces impulse spending by 32%.",
    "body": "Research from Northwestern University shows that people who practice gratitude make better financial decisions and spend less impulsively — about 32% less. Before shopping, take 30 seconds to think of 3 things you already own that you love. This simple mindset shift activates the 'enough' feeling in your brain and weakens the 'I need more' urge.",
    "potentialMonthlySaving": 50,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-016",
    "day": 16,
    "category": "groceries",
    "title": "The Supermarket Layout Trap",
    "summary": "Supermarkets are designed to make you spend more. Here's how to fight back.",
    "body": "Supermarkets put essentials (milk, bread, eggs) at the back so you walk past everything else. End-of-aisle displays aren't always deals — they're prime advertising space. Shop the perimeter first, stick to your list, and don't shop hungry. One more trick: look at the top and bottom shelves. The eye-level shelves have the most expensive brands.",
    "potentialMonthlySaving": 40,
    "readTimeSeconds": 55,
    "isRebeccaPick": false
  },
  {
    "id": "mm-017",
    "day": 17,
    "category": "dining",
    "title": "The Lunch Prep Win",
    "summary": "Packing lunch 4 days a week saves a family $400+ per month.",
    "body": "Buying lunch out costs $10-15 per person. For a couple, that's $20-30 per day, $400-600 per month. Spend 20 minutes on Sunday night prepping lunches for the week. Keep it simple: wraps, salads, leftovers from dinner. Even doing this just 4 days a week (treat yourself on Fridays!) saves $320/month. That's nearly $4,000 a year.",
    "potentialMonthlySaving": 320,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-018",
    "day": 18,
    "category": "transport",
    "title": "The Car Insurance Check",
    "summary": "Comparing car insurance annually saves the average driver $300/year.",
    "body": "If you've been with the same car insurer for more than a year without comparing, you're almost certainly overpaying. Insurers count on your inertia. Spend 15 minutes on a comparison site — the average driver saves $300/year by switching. Set a calendar reminder for 3 weeks before your renewal date so you have time to compare without rushing.",
    "potentialMonthlySaving": 25,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-019",
    "day": 19,
    "category": "shopping",
    "title": "Secondhand First",
    "summary": "Buying kids' clothes and toys secondhand saves 70-80% compared to new.",
    "body": "Kids grow out of clothes in 3-6 months. That $40 outfit gets worn maybe 10 times. Facebook Marketplace, charity shops, and community swap groups have amazing kids' stuff at 70-80% off retail. Many items are barely worn. For toys, try community swap events. Your kids get 'new-to-them' excitement, and you save hundreds per year.",
    "potentialMonthlySaving": 80,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-020",
    "day": 20,
    "category": "mindset",
    "title": "Your Future Self Letter",
    "summary": "Writing a letter to your future self increases savings motivation by 22%.",
    "body": "Studies show that people who feel connected to their future self save more. Try this: write a short letter to yourself 5 years from now. Where are you living? What have you achieved? How does financial security feel? Keep it somewhere you'll see it. Research from UCLA shows this simple exercise increases savings motivation by 22%. Your future self is counting on you.",
    "potentialMonthlySaving": 0,
    "readTimeSeconds": 55,
    "isRebeccaPick": true
  },
  {
    "id": "mm-021",
    "day": 21,
    "category": "energy",
    "title": "Washing Machine Wisdom",
    "summary": "Washing clothes at 30°C instead of 40°C cuts energy use by 57%.",
    "body": "Modern detergents work perfectly well at 30°C. Switching from 40°C to 30°C cuts energy use per wash by 57%. Also, always run full loads — two half-loads use more energy than one full load. And if you can, air-dry instead of using the dryer. The dryer is one of the most energy-hungry appliances in your home.",
    "potentialMonthlySaving": 15,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-022",
    "day": 22,
    "category": "groceries",
    "title": "The Freezer Is Your Best Friend",
    "summary": "Reduce food waste by 40% by freezing bread, milk, and leftovers.",
    "body": "The average family throws away $150 of food per month. Your freezer is the ultimate anti-waste weapon. Freeze: bread (toast it straight from frozen), milk (shake well after thawing), bananas (perfect for smoothies), herbs in olive oil (ice cube trays), and any leftover portions. Reducing food waste by just 40% saves $60/month.",
    "potentialMonthlySaving": 60,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-023",
    "day": 23,
    "category": "subscriptions",
    "title": "The Free Alternatives",
    "summary": "Free alternatives exist for most paid apps and subscriptions.",
    "body": "Before paying for an app or service, search for free alternatives. YouTube has workout videos (skip the gym subscription). Your local library has free ebooks and audiobooks (skip Audible). Free budgeting apps exist (skip the paid ones). Many paid news sites have free alternatives. This isn't about being cheap — it's about being smart with your money.",
    "potentialMonthlySaving": 40,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-024",
    "day": 24,
    "category": "kids",
    "title": "Free Family Fun",
    "summary": "The best family days out are often free — nature walks, beach days, library events.",
    "body": "You don't need to spend $200 at a theme park for kids to have a great time. Nature walks with a scavenger hunt. Beach days with a picnic. Library storytime. Free museum days. Community events. Playground exploration days. Kids crave your attention, not expensive experiences. Start a 'Free Fun Friday' tradition and watch the savings (and memories) build up.",
    "potentialMonthlySaving": 100,
    "readTimeSeconds": 50,
    "isRebeccaPick": true
  },
  {
    "id": "mm-025",
    "day": 25,
    "category": "shopping",
    "title": "The Unsubscribe Power Move",
    "summary": "Unsubscribing from marketing emails reduces impulse purchases by 40%.",
    "body": "Those 'FLASH SALE' and '50% OFF TODAY ONLY' emails are designed to trigger impulse buys. Spend 10 minutes unsubscribing from every retail email. Every single one. Studies show this reduces impulse purchases by up to 40%. You won't miss deals you don't know about, and the deals will still be there if you actively look for them when you need something.",
    "potentialMonthlySaving": 60,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-026",
    "day": 26,
    "category": "dining",
    "title": "The Takeaway Tracker",
    "summary": "Track your takeaway spending for 1 month — the total will surprise you.",
    "body": "Most people drastically underestimate how much they spend on takeaways. The average family spends $250-400/month on food delivery. For one month, add up every coffee, lunch out, dinner delivery, and snack purchase. Write the total on a sticky note on your fridge. Awareness alone typically reduces takeaway spending by 30% the following month.",
    "potentialMonthlySaving": 90,
    "readTimeSeconds": 50,
    "isRebeccaPick": false
  },
  {
    "id": "mm-027",
    "day": 27,
    "category": "mindset",
    "title": "The 'Enough' Number",
    "summary": "Defining your 'enough' number is the foundation of financial confidence.",
    "body": "Financial confidence starts with knowing your 'enough' — the amount you need each month to cover your needs, enjoy some wants, and save a little. Calculate it: Essentials (rent, food, bills, transport) + Fun (a reasonable amount for enjoyment) + Savings (even $50/month counts). Anything above your 'enough' number is bonus. Knowing this number reduces financial anxiety dramatically.",
    "potentialMonthlySaving": 0,
    "readTimeSeconds": 60,
    "isRebeccaPick": true
  },
  {
    "id": "mm-028",
    "day": 28,
    "category": "transport",
    "title": "The Errand Batch",
    "summary": "Batching errands into one trip saves fuel, time, and impulse spending.",
    "body": "Instead of multiple trips throughout the week, batch all your errands into one efficient route. Plan your stops: bank, post office, grocery store, pharmacy — all in one trip. This saves fuel ($10-15/month), time (2-3 hours/week), and reduces impulse spending opportunities. Fewer trips to shops = fewer chances to buy things you don't need.",
    "potentialMonthlySaving": 30,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-029",
    "day": 29,
    "category": "energy",
    "title": "The LED Switch",
    "summary": "Replacing 10 bulbs with LEDs saves $100+ per year in electricity.",
    "body": "If you still have old incandescent or halogen bulbs, each one costs about $12/year in electricity. LEDs cost about $2/year and last 15-25 times longer. Replacing just 10 bulbs saves over $100/year. Yes, LED bulbs cost more upfront ($3-5 each), but the investment pays for itself within 3 months. Start with the rooms you use most.",
    "potentialMonthlySaving": 9,
    "readTimeSeconds": 45,
    "isRebeccaPick": false
  },
  {
    "id": "mm-030",
    "day": 30,
    "category": "mindset",
    "title": "Celebrate Your Progress",
    "summary": "You've completed 30 days of money moments! Here's what to do next.",
    "body": "You've spent 30 days building money awareness. That's incredible! Look at your savings goals — even small progress matters. You now know tricks that most people never learn. The key is consistency, not perfection. Pick your top 3 favorite Money Moments and make them permanent habits. You're building financial confidence that will benefit your whole family for years to come. You've got this, mama!",
    "potentialMonthlySaving": 0,
    "readTimeSeconds": 60,
    "isRebeccaPick": true
  }
]
